Revit 2026 API

# AssetPropertyAddConnectedAsset Method

---

Adds a new connected asset attached to this asset property, if it allows it.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddConnectedAsset(
	string schema
)
```
```vb
Public Sub AddConnectedAsset (
	schema As String
)
```
```cpp
public:
void AddConnectedAsset(
	String^ schema
)
```
```fsharp
member AddConnectedAsset :
        schema : string -> unit
```

#### Parameters

schema String
     The schema name.

| Exception | Condition |
| --- | --- |
| ArgumentException | The schema name is not valid. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The asset property is not editable. -or- Cannot check validity for a property not being edited in AppearanceAssetEditScope. -or- Asset property is already connected to one asset. |

Cannot add a connected asset if one is already connected. Use RemoveConnectedAsset() to avoid an exception being thrown. A new preset asset is created and connected to the property. For "UnifiedBitmap", it contains an empty property unifiedbitmap_Bitmap.

#### Reference

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace